StartMilandr/MDR_Pack_v6/SVD_Files/RST/MDR1986VK214_RST.svd
            <!-- CONTROL fields end-->
          </fields>
        </register>

        <!-- HS_CONTROL-->
        <register>
          <name>HS_CONTROL</name>
          <description>HSE Generator Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!--resetMask>0x0000000F</resetMask--><!--#BE1,#BE3-->
          <resetMask>0x00000003</resetMask><!--#BE9x,#BE4,#BK214,#BK234, #VC1-->

          <fields>
            <field>
              <name>HSE_ON</name>
              <description>HSE Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__HS__HSE_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>HSE Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>HSE On</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_BYP</name>
              <description>HSE Bypass Mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__HS__HSE_BYP_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>HSE forms Clock from external oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>HSE passes Clock from external generator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--#BE1,#BE3-->
            <!--field>
              <name>HSE2_ON</name>
              <description>HSE2 Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__HS__HSE2_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>HSE2 Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>HSE2 On</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            <!--#BE1,#BE3-->
            <!--field>
              <name>HSE2_BYP</name>
              <description>HSE2 Bypass Mode</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__HS__HSE2_BYP_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>HSE2 forms Clock from external oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>HSE2 passes Clock from external generator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->            
            <!-- HS_CONTROL fields end -->
          </fields>
        </register>        

        <!-- CPU_CLOCK -->
        <register>
          <name>CPU_CLOCK</name>
          <description>CPU Clock Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003F7</resetMask>
          <fields>
            <!-- CPU_CLOCK.CPU_C1_SEL -->
            <field>
              <name>CPU_C1_SEL</name>
              <description>CPU_C1 mux freq select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CPU__C1_</headerEnumName>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>CPU_C1 output is HSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI/2</name>
                  <description>CPU_C1 output is HSI/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>CPU_C1 output is HSE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE/2</name>
                  <description>CPU_C1 output is HSE/2</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- CPU_CLOCK.CPU_C2_SEL -->
            <field>
              <name>CPU_C2_SEL</name>
              <description>CPU_C2 mux freq select</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CPU__C2_</headerEnumName>
                <enumeratedValue>
                  <name>CPU_C1</name>
                  <description>Freq from CPU_C1 mux direct</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCPUo</name>
                  <description>Freq from CPU_C1 mux through PLL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- CPU_CLOCK.CPU_C3_SEL -->
            <field>
              <name>CPU_C3_SEL</name>
              <description>CPU_C2 mux output freq devider, [/1, /2, /4 .. /256]</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CPU__C3_</headerEnumName>
                <enumeratedValue><name>div1</name><description>div by 1</description><value>0b0xxx</value></enumeratedValue>
                <enumeratedValue><name>div2</name><description>div by 2</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>div4</name><description>div by 4</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>div8</name><description>div by 8</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>div16</name><description>div by 16</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>div32</name><description>div by 32</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>div64</name><description>div by 64</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>div128</name><description>div by 128</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>div256</name><description>div by 256</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- CPU_CLOCK.HCLK_SEL -->
            <field>
              <name>HCLK_SEL</name>
              <description>Select Clock for CPU</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CPU__HCLK_</headerEnumName>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>CPU clock is HSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_C3</name>
                  <description>CPU clock is CPU_C3 output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>CPU clock is LSE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>CPU clock is LSI</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- CPU_CLOCK fields end-->
          </fields>
        </register>

        <!-- USB_CLOCK #10 -->
        <!--#BE1,#BE4,#BE9x,#VC1-->
        <!--register>
          <name>USB_CLOCK</name>
          <description>USB Clock Control</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000117</resetMask>
          <fields>
            <!-- USB_CLOCK.USB_C1_SEL -->
            <!--field>
              <name>USB_C1_SEL</name>
              <description>USB_C1 mux freq select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__USB__C1_</headerEnumName>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>USB_C1 output is HSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI/2</name>
                  <description>USB_C1 output is HSI/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>USB_C1 output is HSE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE/2</name>
                  <description>USB_C1 output is HSE/2</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- USB_CLOCK.USB_C2_SEL -->
            <!--field>
              <name>USB_C2_SEL</name>
              <description>USB_C2 mux freq select</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__USB__C2_</headerEnumName>
                <enumeratedValue>
                  <name>USB_C1</name>
                  <description>Freq from CPU_C1 mux direct</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLUSBo</name>
                  <description>Freq from CPU_C1 mux through PLL_USB</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- USB_CLOCK.USB_C3_SEL -->
            <!--field>
              <name>USB_C3_SEL</name>
              <description>USB_C3 Input Select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__USB__C3_</headerEnumName>
                <enumeratedValue>
                  <name>USB_C2</name>
                  <description>C3 Input is freq from C2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_C2_div2</name>
                  <description>C3 Input is freq from C2/2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- USB_CLOCK.USB_EN -->
            <!--field>
              <name>USB_EN</name>
              <description>USB Clock Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__USB__CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- USB_CLOCK fields end-->
          <!--/fields>
        </register-->

        <!-- PER1_CLOCK #10 -->
        <!--#BE4,#BK214,#BK234-->
        <register>
          <name>PER1_CLOCK</name>
          <description>Peripherials Clock Control1</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <!--resetMask>0x0000003F</resetMask--><!--#BE4-->
          <resetMask>0x00003FFF</resetMask><!--#BK214-->
          <!--resetMask>0x0000001F</resetMask--><!--#BK234-->

          <fields>
            <!-- PER1_CLOCK.PER1_C1_SEL -->
            <field>
              <name>PER1_C1_SEL</name>
              <description>PER1_C1 mux freq select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PER1__C1_</headerEnumName>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>PER1_C1 output is LSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI/2</name>
                  <description>PER1_C1 output is LSI/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>PER1_C1 output is LSE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE/2</name>
                  <description>PER1_C1 output is LSE/2</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- PER1_CLOCK.PER1_C2_SEL -->
            <field>
              <name>PER1_C2_SEL</name>
              <description>PER1_C2 mux freq select</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PER1__C2_</headerEnumName>
                <enumeratedValue>
                  <name>CPU_C1</name>
                  <description>PER1_C2 output is CPU_C1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER1_C1</name>
                  <description>PER1_C2 output is PER1_C1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCPUo</name>
                  <description>PER1_C2 output is PLLCPUo</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_C1</name>
                  <description>PER1_C2 output is HSI_C1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- PER1_CLOCK.DEBUG_EN -->
            <field>
              <name>DEBUG_EN</name>
              <description>Debug clock enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PER1__DEBUG_CLK</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Debug disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Debug enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- PER1_CLOCK.DMA_EN -->
            <!--#BE4,#BK234-->
            <!--field>
              <name>DMA_EN</name>
              <description>DMA clock enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PER1__DMA_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>DMA clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>DMA clock enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            <!--#BK214-->
            <field derivedFrom="PER1_C2_SEL">
              <name>TIM2_C2_SEL</name>
              <description>TIM2_C2 mux freq select</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <!--#BK214-->
            <field derivedFrom="PER1_C2_SEL">
              <name>UART1_C2_SEL</name>
              <description>UART1_C2 mux freq select</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <!--#BK214-->
            <field derivedFrom="PER1_C2_SEL">
              <name>UART2_C2_SEL</name>
              <description>UART2_C2 mux freq select</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <!--#BK214-->
            <field derivedFrom="PER1_C2_SEL">
              <name>SSP2_C2_SEL</name>
              <description>SSP2_C2 mux freq select</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>

            <!-- PER1_CLOCK fields end-->
          </fields>
        </register>

        <!-- ADC_CLOCK-->
        <!--#BE1,#BE3,#BE9x,#VC1-->
        <!--register>
          <name>ADC_CLOCK</name>
          <description>ADC Clock Control</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00002F33</resetMask><!--#BE1,#BE9x-->
          <!--resetMask>0x8F332F33</resetMask--><!--#BE3,#VC1-->

          <!--fields>
            <!-- ADC_CLOCK.ADC_C1_SEL -->
            <!--field>
              <name>ADC_C1_SEL</name>
              <description>ADC_C1 mux freq select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADC__C1_</headerEnumName>
                <enumeratedValue>
                  <name>CPU_C1</name>
                  <description>ADC_C1 output is CPU_C1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_C1</name>
                  <description>ADC_C1 output is USB_C1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_C2</name>
                  <description>ADC_C1 output is CPU_C2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_C2</name>
                  <description>ADC_C1 output is USB_C2</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- ADC_CLOCK.ADC_C2_SEL -->
            <!--field>
              <name>ADC_C2_SEL</name>
              <description>ADC_C2 mux freq select</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADC__C2_</headerEnumName>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>ADC_C2 output is LSE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>ADC_C2 output is LSI</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_C1</name>
                  <description>ADC_C2 output is ADC_C1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_C1</name>
                  <description>ADC_C2 output is HSI_C1</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- ADC_CLOCK.ADC_C3_SEL -->
            <!--field derivedFrom="MDR_RST_CLOCK.CPU_CLOCK.CPU_C3_SEL">
              <name>ADC_C3_SEL</name>
              <description>ADC_C2 mux output freq devider, [/1, /2, /4 .. /256]</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ADC_CLOCK.ADC_CLK_EN -->
            <!--field>
              <name>ADC_CLK_EN</name>
              <description>ADC Clock Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADC__CLK_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>ADC clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>ADC clock enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

