StartMilandr/MDR_Pack_v6/SVD_Files/RST/MDR1986VK214_RST.svd
        <!-- ETH_CLOCK 0x34-->
        <!--#BE1,#BE3-->
        <!--register>
          <name>ETH_CLOCK</name>
          <description>Ethernet and MIL Clock Control</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask><!--#BE1-->
          <!--resetMask>0xFFFFFFFF</resetMask--><!--#BE3-->
          <!--fields>
            <!-- ETH_CLOCK.ETH_BRG -->
            <!--field>
              <name>ETH_BRG</name>
              <description>Always set to 0!</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ETH_CLOCK.MIL_BRG -->
            <!--field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">            
              <name>MIL_BRG</name>
              <description>HCLK freq divider to get MAN_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ETH_CLOCK.PHY_BRG -->
            <!--field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>PHY_BRG</name>
              <description>HCLK freq divider to get PHY_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ETH_CLOCK.ETH_CLK_EN -->
            <!--field>
              <name>ETH_CLK_EN</name>
              <description>Ethernet MAC Clock Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__MAC_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>MAC Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>MAC Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ETH_CLOCK.MIL_CLK_EN -->
            <!--field>
              <name>MIL_CLK_EN</name>
              <description>MIL-STD CLOCK Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__MIL_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>MIL Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>MIL Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ETH_CLOCK.SLEEP -->
            <!--field>
              <name>SLEEP</name>
              <description>Switch to Sleep mode</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__SLEEP_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Normal Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GoSLEEP</name>
                  <description>Go to SLEEP</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ETH_CLOCK.PHY_CLK_EN -->
            <!--field>
              <name>PHY_CLK_EN</name>
              <description>Ethernet PHY CLOCK Enable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__PHY_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>MIL Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>MIL Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ETH_CLOCK.PHY_CLK_SEL -->
            <!--field>
              <name>PHY_CLK_SEL</name>
              <description>Ethernet PHY CLOCK Select</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__PHY_SEL_</headerEnumName>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>PHY Clock from HSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>PHY Clock from HSE</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCPUo</name>
                  <description>PHY Clock from PLLCPUo</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE2</name>
                  <description>PHY Clock from HSE2</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ETH_CLOCK.ETH2_CLK_EN -->
            <!--#BE3-->
            <!--field>
              <name>ETH2_CLK_EN</name>
              <description>Ethernet2 MAC Clock Enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__MAC2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>MAC Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>MAC Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->

