StartMilandr/MDR_Pack_v6/SVD_Files/RST/MDR1986VK214_RST.svd
            <!-- ETH_CLOCK fields end-->
          <!--/fields>
        </register-->

        <!-- SSP_CLOCK2 0x34-->
        <!--#VC1-->
        <!--register>
          <name>SSP_CLOCK2</name>
          <description>SSP Clock Control 2</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01000007</resetMask>
          <fields>
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">            
              <name>SSP4_BRG</name>
              <description>HCLK freq divider to get SSP4_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SSP4_CLK_EN</name>
              <description>SSP4 Clock Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__SSP4__CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SSP4 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>SSP4 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <!-- SSP_CLOCK2 fields end-->
          <!--/fields>
        </register-->

        <!-- PER2_CLOCK 0x38-->
        <!--#BE3-->
        <!--register>
          <name>PER2_CLOCK</name>
          <description>Peripherials Clock Control 2</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>AUC_CLK_EN</name>
              <description>AudioCodec Clock Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>LED_CLK_EN</name>
              <description>LED Clock Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>KEY_CLK_EN</name>
              <description>Keyboard Clock Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>PORTG_CLK_EN</name>
              <description>PORT_G Clock Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>UART3_CLK_EN</name>
              <description>UART3 Clock Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>UART4_CLK_EN</name>
              <description>UART4 Clock Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>SSP4_CLK_EN</name>
              <description>SSP4 Clock Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>PORTH_CLK_EN</name>
              <description>PORT_H Clock Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>PORTI_CLK_EN</name>
              <description>PORT_I Clock Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <!-- PER2_CLOCK fields end-->
          <!--/fields>
        </register-->

        <!-- DSP_CONTROL_STATUS 0x38-->
        <!--#VC1-->
        <!--register>
          <name>DSP_CONTROL_STATUS</name>
          <description>DSP Control and Status register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000CF7F</resetMask>
          <fields>
            <field>
              <name>RST_DSP</name>
              <description>Reset DSP block</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__RST_BLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Work</name>
                  <description>DSP Block is Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>DSP Block in Reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_DSP_CPU</name>
              <description>Reset DSP Core</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__RST_CPU_</headerEnumName>
                <enumeratedValue>
                  <name>Work</name>
                  <description>DSP Core is Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>DSP Core in Reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>            
            <field>
              <name>RST_DSP_MEM</name>
              <description>Reset DSP Memory Blocks</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__RST_MEM_</headerEnumName>
                <enumeratedValue>
                  <name>Work</name>
                  <description>DSP memory is Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>DSP memory disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_DSP_PER</name>
              <description>Reset DSP Peripherial Blocks</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__RST_PER_</headerEnumName>
                <enumeratedValue>
                  <name>Work</name>
                  <description>DSP Peripherials are Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>DSP Peripherials in Reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOLD</name>
              <description>Call to stop DSP command sequencer</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__HOLD_</headerEnumName>
                <enumeratedValue>
                  <name>DoStop</name>
                  <description>Request to Stop execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Stop request inactive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIO</name>
              <description>Flag from RISC to DSP Core</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__BIO_</headerEnumName>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Flag Low Level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Flag High Level</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XF_EN</name>
              <description>Output flag XF to PA[15] pin</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__XF_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Flag XF disconnected from PA[15]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Flag XF connected to PA[15]</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XF</name>
              <description>Flag from DSP to RISC core</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__XF_</headerEnumName>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Flag Low Level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Flag High Level</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOLDA</name>
              <description>DSP Command Sequencer status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__HOLDA_</headerEnumName>
                <enumeratedValue>
                  <name>Stopped</name>
                  <description>Command execution stopped</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Running</name>
                  <description>Commands are executing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>DSP Command Sequencer status</description>
              <bitRange>[11:10]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__IDLE_</headerEnumName>
                <enumeratedValue>
                  <name>Working</name>
                  <description>DSP Running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CLOCK_DSP</name>
                  <description>DSP Clock disabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CLOCK_DSP_MEM</name>
                  <description>DSP Core and Memory Clock disabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CLOCK_DSP_MEM_PER</name>
                  <description>DSP Core, Memory and Peripherials Clock disabled</description>
                  <value>3</value>
                </enumeratedValue>                
              </enumeratedValues>
            </field>            
            <field>
              <name>BRTRD</name>
              <description>RISC - DSP bridge transfer status</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__BRIDGE_</headerEnumName>
                <enumeratedValue>
                  <name>Transfer</name>
                  <description>Transfer is performing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Completed</name>
                  <description>Transfer completed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field> 
            <field>
              <name>RD_BUFF_EN</name>
              <description>Pre-read DSP Addr space</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__PreRead_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Pre-Read disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Pre-Read enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- DSP_CLOCK2 fields end-->
          <!--/fields>
        </register-->        

        <!-- UART_SSP_CLOCK -->
        <!--register>
          <name>UART_SSP_CLOCK</name>
          <description>UART and SSP Clock Control</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07070707</resetMask>
          <fields>
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>UART3_BRG</name>
              <description>HCLK freq divider to get UART3_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>           
            </field>
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>UART4_BRG</name>
              <description>HCLK freq divider to get UART4_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>SSP3_BRG</name>
              <description>HCLK freq divider to get SSP3_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UART3_CLK_EN</name>
              <description>UART3_CLOCK enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UARTSSP__UART3_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>UART3 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>UART3 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART4_CLK_EN</name>
              <description>UART4_CLOCK enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UARTSSP__UART4_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>UART4 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>UART4 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSP3_CLK_EN</name>
              <description>SSP3_CLOCK enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UARTSSP__SSP3_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SSP3 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>SSP3 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- UART_SSP_CLOCK fields end-->
          <!--/fields>
        </register-->


        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- peripherals end-->
  </peripherals>

</device>  